import random
import time

print("🧓 СИМУЛЯТОР ДІДА НА ЛАВОЧЦІ 🪑")
print("Твоє завдання — вижити і не вибухнути від злості 😡")
print("-" * 45)

energy = 100

events = [
    ("🚗 Машина проїхала занадто швидко!", -15),
    ("📱 Підліток голосно дивиться TikTok!", -20),
    ("🐕 Пес гавкає без причини!", -10),
    ("🕊️ Голуб сів поруч. Нормальний голуб 👍", +10),
    ("☕ Сусід приніс чайок", +20),
    ("⚽ М'яч прилетів у лавочку!", -25),
    ("👵 Бабця сказала: 'Який ви гарний чоловік'", +30),
    ("🛴 Електросамокат пролетів повз 😱", -35),
]

while energy > 0:
    input("\n👉 Натисни ENTER щоб прожити ще 1 хвилину на лавочці...")

    event = random.choice(events)

    print("\n⏳ Обробка ситуації...")
    time.sleep(1)

    print(event[0])

    energy += event[1]

    if energy > 100:
        energy = 100

    print(f"❤️ Рівень нервів: {energy}/100")

    if energy <= 70:
        print("😠 Дід починає бурчати...")

    if energy <= 40:
        print("🤬 'У НАШ ЧАС ТАКОГО НЕ БУЛО!!!'")

    if energy <= 20:
        print("💀 Дід уже пише скаргу в ЖЕК")

print("\n😅 Дід остаточно рознервувався та пішов гуляти в карти з іншим дідом!")
print("Кінець гри!")
print("-" * 45)